### 3.Pandas - kluczowy pakiet do danych tabelarycznych
- Wczytywanie danych tabelarycznych (CSV, TSV, XLS)
- Operacje na kolumnach i wierszach
- Filtrowanie i procesowanie danych
- Odczytywanie danych statystycznych
- Modyfikacja danych z użyciem funkcji pythonowych
- Agregacja, podobieństwa do SQL
- Pandas Profiling - raporty

Pandas to popularna biblioteka programistyczna w języku Python, która jest używana do manipulacji i analizy danych. Jest to potężne narzędzie, które ułatwia wczytywanie, przekształcanie, eksplorację i analizę danych w formie tabelarycznej, takich jak arkusze kalkulacyjne lub bazy danych.

##### Główne cechy i funkcje biblioteki Pandas:

1. Struktury danych: Pandas wprowadza dwie główne struktury danych: Series i DataFrame.

- Series: To jednowymiarowa tablica danych, podobna do kolumny w arkuszu kalkulacyjnym lub kolumny w bazie danych. Series można traktować jako uporządkowany zestaw danych z indeksem.

- DataFrame: To dwuwymiarowa struktura danych, która przypomina tabelę lub arkusz kalkulacyjny. DataFrame składa się z kolumn i wierszy, a każda kolumna może zawierać różne typy danych.

2. Wczytywanie i zapisywanie danych: Pandas umożliwia wczytywanie danych z różnych źródeł, takich jak pliki CSV, Excel, SQL, JSON i wiele innych. Możesz również zapisywać dane do tych formatów.

3. Indeksowanie i selekcja danych: Pandas oferuje różnorodne mechanizmy indeksowania i selekcji danych, co pozwala na dostęp do konkretnych kolumn, wierszy lub komórek danych w bardzo elastyczny sposób.

4. Operacje na danych: Biblioteka umożliwia wykonywanie różnych operacji na danych, takich jak filtrowanie, sortowanie, grupowanie, łączenie i wiele innych. Możesz także przeprowadzać operacje matematyczne na danych w sposób efektywny.

5. Obsługa brakujących danych: Pandas oferuje narzędzia do radzenia sobie z danymi brakującymi, takie jak usuwanie lub uzupełnianie brakujących wartości.

6. Analiza i eksploracja danych: Biblioteka ułatwia eksplorację danych poprzez obliczanie statystyk opisowych, generowanie wykresów i wizualizacji danych.

7. Obsługa szeregów czasowych: Pandas posiada wsparcie dla operacji na szeregach czasowych, co jest przydatne w analizie danych związanych z czasem.

8. Integracja z innymi narzędziami: Pandas można łatwo łączyć z innymi bibliotekami do analizy danych i uczenia maszynowego, takimi jak NumPy, SciPy, Matplotlib, scikit-learn i wiele innych.

9. Wsparcie społeczności: Pandas posiada aktywną społeczność użytkowników i deweloperów, co oznacza, że istnieje wiele dostępnych źródeł, tutoriali i materiałów do nauki.

##### Strona internetowa
- https://pandas.pydata.org/

##### Dokumentacja
- https://pandas.pydata.org/pandas-docs/stable/

##### Polecana strona
- https://www.dataschool.io/easier-data-analysis-with-pandas/

In [2]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\tomas\appdata\local\programs\anaconda3\lib\site-packages (2.0.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\tomas\appdata\local\programs\anaconda3\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\tomas\appdata\local\programs\anaconda3\lib\site-packages (from pandas) (2024.1)
Requirement already satisfied: tzdata>=2022.1 in c:\users\tomas\appdata\local\programs\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: numpy>=1.20.3 in c:\users\tomas\appdata\local\programs\anaconda3\lib\site-packages (from pandas) (1.24.3)
Requirement already satisfied: six>=1.5 in c:\users\tomas\appdata\local\programs\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [1]:
# pip install pandas

import pandas as pd
pd.__version__

'2.0.3'

### `pd.Series()` - Tablica jednowymiarowa zawierająca dane oraz ich indeksy
Series jest jednowymiarową tablicą z etykietowanym indeksem, która może przechowywać dowolny typ danych – liczby, tekst, wartości logiczne, daty itp. Jest to fundament, na którym buduje się bardziej złożone struktury danych w Pandas.

In [3]:
s = pd.Series([1,2,3])
s

0    1
1    2
2    3
dtype: int64

In [4]:
s = pd.Series(['a','b','c'])
s

0    a
1    b
2    c
dtype: object

In [8]:
s = pd.Series(data=[1,'b',3], index=['a', 'b', 'c'])
s

a    1
b    b
c    3
dtype: object

In [3]:
import numpy as np

s = pd.Series(data=[1, np.nan, 3], index=['a', 'b', 'c'])
s

a    1.0
b    NaN
c    3.0
dtype: float64

In [11]:
s = pd.Series(data=[True, False, True])
s

0     True
1    False
2     True
dtype: bool

In [14]:
pd.Series(data=np.arange(1, 11))

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int32

In [13]:
s = pd.Series(data=np.arange(1, 11), index=pd.date_range(start='20250324', periods=10))
s

2025-03-24     1
2025-03-25     2
2025-03-26     3
2025-03-27     4
2025-03-28     5
2025-03-29     6
2025-03-30     7
2025-03-31     8
2025-04-01     9
2025-04-02    10
Freq: D, dtype: int32

In [15]:
s.dtypes

dtype('int32')

In [16]:
s.index

DatetimeIndex(['2025-03-24', '2025-03-25', '2025-03-26', '2025-03-27',
               '2025-03-28', '2025-03-29', '2025-03-30', '2025-03-31',
               '2025-04-01', '2025-04-02'],
              dtype='datetime64[ns]', freq='D')

In [17]:
s.values

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10])

## Series vs tablica NumPy

Series uogólnia jednowymiarową tablicę NumPy:
* tablica NumPy posiada wewnętrzną indeksację w stylu Pythona (*implicit index*);
* Series posiada wewnętrzną indeksację w stylu Pythona plus indeksację za pomocą etykiet.

In [18]:
s = pd.Series([3, 1, 2.71, -10], index=['a', 'b', 'c', 'd'])
s

a     3.00
b     1.00
c     2.71
d   -10.00
dtype: float64

In [20]:
s['c']

2.71

Indeks etykiet może:
* nie zachowywać kolejności,
* posiadać luki,
* posiadać powtórzenia.

In [21]:
s = pd.Series([3, 1, 2.71, -10, 50], index=[3, 2, 5, 2, 100])
s

3       3.00
2       1.00
5       2.71
2     -10.00
100    50.00
dtype: float64

In [22]:
s = pd.Series(data=['python', 'sas', 'r'], name='jezyki')
s

0    python
1       sas
2         r
Name: jezyki, dtype: object

## Series jako rodzaj słownika

Klucze słownika przechodzą na etykiety podczas przekształcania słownika na obiekt Series:

In [31]:
ludność_dict = {'Polska_Ludowa': 38501,
                'Czechy': 10221,
                'Szwecja': 9045,
                'Niemcy': 82370,
                'Litwa': 3565}

ludność = pd.Series(ludność_dict)
ludność

Polska_Ludowa    38501
Czechy           10221
Szwecja           9045
Niemcy           82370
Litwa             3565
dtype: int64

In [32]:
ludność['Polska_Ludowa']

38501

In [33]:
ludność.Polska_Ludowa # jak pisać żeby używać tej notacji (z _)

38501

In [35]:
'Czechy' in ludność

True

In [36]:
ludność.keys()

Index(['Polska_Ludowa', 'Czechy', 'Szwecja', 'Niemcy', 'Litwa'], dtype='object')

In [38]:
ludność['Grecja'] = 10723

In [39]:
ludność

Polska_Ludowa    38501
Czechy           10221
Szwecja           9045
Niemcy           82370
Litwa             3565
Grecja           10723
dtype: int64

Series jako tablica jednowymiarowa pozwala na dostęp do wartości poprzez:
* wycinki,
* maskowanie,
* wymyślne indeksowanie.

In [41]:
ludność

Polska_Ludowa    38501
Czechy           10221
Szwecja           9045
Niemcy           82370
Litwa             3565
Grecja           10723
dtype: int64

In [40]:
# Wycinek indeksów z poziomu etykiet
ludność['Czechy':'Niemcy'] # Prawy kraniec zaliczony!

Czechy     10221
Szwecja     9045
Niemcy     82370
dtype: int64

In [42]:
# Wycinek wewnętrznych indeksów Pythona
ludność[1:3] # Prawie kraniec wykluczony!

Czechy     10221
Szwecja     9045
dtype: int64

In [43]:
# Maskowanie
ludność[(10000 < ludność) & (ludność < 40000)]

Polska_Ludowa    38501
Czechy           10221
Grecja           10723
dtype: int64

In [44]:
# Indeksowanie wymyślne (fancy indexing), indeks etykiet
ludność[['Czechy', 'Grecja', 'Litwa']]

Czechy    10221
Grecja    10723
Litwa      3565
dtype: int64

In [45]:
# Indeksowanie wymyślne (fancy indexing), indeks wewnętrzny Pythona
ludność[[2, 4, 2]]

Szwecja    9045
Litwa      3565
Szwecja    9045
dtype: int64

## Zagadka

In [46]:
s = pd.Series(['a', 'b', 'c'], index=[1, 2, 3])
s

1    a
2    b
3    c
dtype: object

Jaka wartość kryje się pod `s[2]`? Co zwróci `s[1:3]`?

In [48]:
s[2]

'b'

In [49]:
s[1:3]

2    b
3    c
dtype: object

## Indeksery `loc`, `iloc`

* Atrybut `loc` zawsze odnosi się do indeksów z poziomu etykiet.
* Atrybut `iloc` zawsze odnosi się do indeksów wewnętrznych Pythona, czyli do zwykłej numeracji całkowitoliczbowej od zera w górę.

In [60]:
s = pd.Series(['a', 'b', 'c', 'd'], index=[1, 2, 3, 4])
s

1    a
2    b
3    c
4    d
dtype: object

In [53]:
for i in range(5):
    print(i)

0
1
2
3
4

In [61]:
s.iloc[1] # wewnętrzna indeksacja Pythona

'b'

In [62]:
s.loc[1] # zdefiniowane indexy

'a'

In [69]:
s

1    a
2    b
3    c
4    d
dtype: object

In [68]:
s.iloc[1:2] # Wyklucza prawy kraniec!

2    b
dtype: object

In [67]:
s

1    a
2    b
3    c
4    d
dtype: object

In [66]:
s.loc[1:3] # Włącza prawy kraniec!

1    a
2    b
3    c
dtype: object

In [76]:
s.iloc[1:3]

2    b
3    c
dtype: object

In [4]:
ceny_akcji = pd.Series(data={'Orlen': 70, 'PZU': 30, 'KGHM': 100, 'PKP': np.nan})
ceny_akcji

Orlen     70.0
PZU       30.0
KGHM     100.0
PKP        NaN
dtype: float64

In [5]:
ceny_akcji['Orlen']

70.0

In [6]:
ceny_akcji.Orlen

70.0

In [7]:
ceny_akcji.iloc[0]

70.0

In [8]:
ceny_akcji.count()

3

In [11]:
ceny_akcji[ceny_akcji.isna()]

PKP   NaN
dtype: float64

In [16]:
ceny_akcji.value_counts(dropna=False)

70.0     1
30.0     1
100.0    1
NaN      1
Name: count, dtype: int64

In [17]:
ceny_akcji.sum()

200.0

In [18]:
ceny_akcji.min()

30.0

In [19]:
ceny_akcji.max()

100.0

In [20]:
ceny_akcji.describe()

count      3.000000
mean      66.666667
std       35.118846
min       30.000000
25%       50.000000
50%       70.000000
75%       85.000000
max      100.000000
dtype: float64

In [21]:
ceny_akcji.nlargest(2)

KGHM     100.0
Orlen     70.0
dtype: float64

In [22]:
ceny_akcji.nsmallest(2)

PZU      30.0
Orlen    70.0
dtype: float64

In [23]:
ceny_akcji.rank()

Orlen    2.0
PZU      1.0
KGHM     3.0
PKP      NaN
dtype: float64

In [26]:
ceny_akcji.sort_values(ascending=False) # sortowanie malejąco

KGHM     100.0
Orlen     70.0
PZU       30.0
PKP        NaN
dtype: float64

In [28]:
ceny_akcji.sort_index(ascending=False)

PZU       30.0
PKP        NaN
Orlen     70.0
KGHM     100.0
dtype: float64

## `pd.Series()`

Funkcja `pd.Series()` pozwala na tworzenie obiektów Series wg. schematu
```python
pd.Series(dane, index=index)
```
Parametr `index` jest opcjonalny, parametr `dane` może przyjmować rozmaitą postać.

### `pd.DataFrame()` - Dwuwymiarowa tabela, w której kolumnami są obiekty Series.
pd.DataFrame() jest jedną z najbardziej wszechstronnych i podstawowych struktur danych oferowanych przez bibliotekę Pandas. DataFrame to dwuwymiarowa tablica danych, która może przechowywać dane o różnych typach (liczby, tekst, wartości logiczne, daty itp.) w kolumnach. Struktura ta jest podobna do arkusza kalkulacyjnego lub tabeli relacyjnej bazy danych, co czyni ją niezwykle użyteczną do analizy danych.

**W analizie danych DataFrame jest często przedstawiana jako tabela, w której kolumny to zmienne a wiersze to obserwacje.**

In [29]:
ludność_dict = {'Polska': 38501,
                'Czechy': 10221,
                'Szwecja': 9045,
                'Niemcy': 82370,
                'Litwa': 3565}

ludność = pd.Series(ludność_dict)
ludność

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
dtype: int64

In [30]:
powierzchnia_dict = {'Polska': 322.6,
                     'Czechy': 78.9,
                     'Szwecja': 450,
                     'Niemcy': 357,
                     'Litwa': 65.3}

powierzchnia = pd.Series(powierzchnia_dict)
powierzchnia

Polska     322.6
Czechy      78.9
Szwecja    450.0
Niemcy     357.0
Litwa       65.3
dtype: float64

In [82]:
kraje = pd.DataFrame({'powierzchnia': powierzchnia,
                     'ludność': ludność})
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

## DataFrame uogólnia tablicę 2D NumPy

Podobnie jak Series obiekty DataFrame posiadają dwa poziomy indeksów dla wierszy: 
* wewnętrzny z numeracją liczbami całkowitymi od zera,
* zbudowany z etykiet.

In [32]:
kraje.index

Index(['Polska', 'Czechy', 'Szwecja', 'Niemcy', 'Litwa'], dtype='object')

In [33]:
kraje.columns

Index(['powierzchnia', 'ludność'], dtype='object')

In [36]:
kraje['powierzchnia']

Polska     322.6
Czechy      78.9
Szwecja    450.0
Niemcy     357.0
Litwa       65.3
Name: powierzchnia, dtype: float64

In [37]:
kraje['ludność']

Polska     38501
Czechy     10221
Szwecja     9045
Niemcy     82370
Litwa       3565
Name: ludność, dtype: int64

In [38]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [56]:
kraje[(kraje.powierzchnia > 300) & (kraje.ludność > 10000)]

        powierzchnia  ludność
Polska         322.6    38501
Niemcy         357.0    82370

In [57]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [86]:
kraje['gestosc_zaludnienia'] = kraje['ludność']/kraje['powierzchnia']

In [87]:
kraje

         powierzchnia  ludność  gestosc_zaludnienia
Polska          322.6    38501           119.345939
Czechy           78.9    10221           129.543726
Szwecja         450.0     9045            20.100000
Niemcy          357.0    82370           230.728291
Litwa            65.3     3565            54.594181

In [88]:
kraje.gestosc_zaludnienia = kraje.gestosc_zaludnienia.round(2)

In [89]:
kraje

         powierzchnia  ludność  gestosc_zaludnienia
Polska          322.6    38501               119.35
Czechy           78.9    10221               129.54
Szwecja         450.0     9045                20.10
Niemcy          357.0    82370               230.73
Litwa            65.3     3565                54.59

### dodanie wiersza

In [90]:
kraje = pd.concat([kraje, pd.DataFrame({'powierzchnia': 10, 'ludność': 10, 'gestosc_zaludnienia': 10}, index=['przykladowy kraj'])]) # 1 sposób

In [91]:
kraje.loc['przykladowy kraj 2'] = [10,10,10] # 2 sposób

### Usuwanie WIERSZA

In [104]:
kraje

         powierzchnia  ludność  gestosc_zaludnienia
Polska          322.6    38501               119.35
Czechy           78.9    10221               129.54
Szwecja         450.0     9045                20.10
Niemcy          357.0    82370               230.73
Litwa            65.3     3565                54.59

In [100]:
kraje.drop('przykladowy kraj', inplace=True) # metoda 1

In [102]:
kraje = kraje.drop('przykladowy kraj 2') # metoda 2

In [103]:
kraje

         powierzchnia  ludność  gestosc_zaludnienia
Polska          322.6    38501               119.35
Czechy           78.9    10221               129.54
Szwecja         450.0     9045                20.10
Niemcy          357.0    82370               230.73
Litwa            65.3     3565                54.59

In [108]:
kraje[kraje.powierzchnia > 300].index

Index(['Polska', 'Szwecja', 'Niemcy'], dtype='object')

In [109]:
kraje.drop(kraje[kraje.powierzchnia > 300].index)

        powierzchnia  ludność  gestosc_zaludnienia
Czechy          78.9    10221               129.54
Litwa           65.3     3565                54.59

In [110]:
kraje

         powierzchnia  ludność  gestosc_zaludnienia
Polska          322.6    38501               119.35
Czechy           78.9    10221               129.54
Szwecja         450.0     9045                20.10
Niemcy          357.0    82370               230.73
Litwa            65.3     3565                54.59

In [111]:
kraje.values

array([[3.2260e+02, 3.8501e+04, 1.1935e+02],
       [7.8900e+01, 1.0221e+04, 1.2954e+02],
       [4.5000e+02, 9.0450e+03, 2.0100e+01],
       [3.5700e+02, 8.2370e+04, 2.3073e+02],
       [6.5300e+01, 3.5650e+03, 5.4590e+01]])

In [114]:
kraje.iloc[:3,:2]

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045

In [116]:
kraje[['powierzchnia', 'gestosc_zaludnienia']]

         powierzchnia  gestosc_zaludnienia
Polska          322.6               119.35
Czechy           78.9               129.54
Szwecja         450.0                20.10
Niemcy          357.0               230.73
Litwa            65.3                54.59

In [120]:
kraje.loc[['Polska', 'Niemcy'], 'ludność']

Polska    38501
Niemcy    82370
Name: ludność, dtype: int64

In [121]:
kraje.describe()

       powierzchnia       ludność  gestosc_zaludnienia
count      5.000000      5.000000             5.000000
mean     254.760000  28740.400000           110.862000
std      173.202029  32924.462908            80.922077
min       65.300000   3565.000000            20.100000
25%       78.900000   9045.000000            54.590000
50%      322.600000  10221.000000           119.350000
75%      357.000000  38501.000000           129.540000
max      450.000000  82370.000000           230.730000

In [122]:
kraje.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Polska to Litwa
Data columns (total 3 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   powierzchnia         5 non-null      float64
 1   ludność              5 non-null      int64
 2   gestosc_zaludnienia  5 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 332.0+ bytes

### usuwanie kolumny

In [126]:
kraje.drop('gestosc_zaludnienia', axis=1, inplace=True)

In [127]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [ ]:
# 2 sposób
# del kraje['gestosc_zaludnienia']

In [128]:
kraje

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Niemcy          357.0    82370
Litwa            65.3     3565

In [129]:
kraje.drop('Niemcy')

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Litwa            65.3     3565

In [131]:
kraje[kraje.index != 'Niemcy']

         powierzchnia  ludność
Polska          322.6    38501
Czechy           78.9    10221
Szwecja         450.0     9045
Litwa            65.3     3565

#### Braki danych

#### Usuwanie

In [132]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})

In [133]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [134]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       2 non-null      float64
 1   B       1 non-null      float64
 2   C       3 non-null      int64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [136]:
df.isna().sum() # ile wartości pustych w danych kolumnach

A    1
B    2
C    0
dtype: int64

In [137]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [138]:
df.dropna()

     A    B  C
0  1.0  5.0  1

In [140]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [142]:
df.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

#### Wypełnianie

In [143]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [145]:
df.fillna('BRAK')

      A     B  C
0   1.0   5.0  1
1   2.0  BRAK  2
2  BRAK  BRAK  3

In [146]:
df.fillna(0)

     A    B  C
0  1.0  5.0  1
1  2.0  0.0  2
2  0.0  0.0  3

In [151]:
df['A'].fillna(df['A'].mean(), inplace=True)

In [153]:
df['B'].fillna(df['B'].median(), inplace=True)

In [154]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  5.0  2
2  1.5  5.0  3

### Grupowanie (group by)

In [155]:
# Tworzymy ramkę danych
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [156]:
data

{'Company': ['GOOG', 'GOOG', 'MSFT', 'MSFT', 'FB', 'FB'],
 'Person': ['Sam', 'Charlie', 'Amy', 'Vanessa', 'Carl', 'Sarah'],
 'Sales': [200, 120, 340, 124, 243, 350]}

In [157]:
df = pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [158]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Company  6 non-null      object
 1   Person   6 non-null      object
 2   Sales    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [161]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [166]:
df.groupby('Company').mean(numeric_only=True).sort_values('Sales', ascending=False)

         Sales
Company
FB       296.5
MSFT     232.0
GOOG     160.0

In [167]:
by_comp = df.groupby("Company")

In [168]:
by_comp.min(numeric_only=True)

         Sales
Company
FB         243
GOOG       120
MSFT       124

In [169]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [173]:
by_comp.describe().T['GOOG'].iloc[1]

160.0

### Daty - pd.Timestamp()
https://docs.python.org/3/library/datetime.html

In [174]:
pd.Timestamp.today()

Timestamp('2025-03-25 10:49:35.395343')

In [177]:
data = '2025-25-03'

In [179]:
data[5:7]

'25'

In [181]:
data[8:11]

'03'

In [ ]:
%pip install openpyxl

In [183]:
data_dzis = pd.Timestamp(f'2025-{data[8:11]}-{data[5:7]}')

In [194]:
data_dzis = data_dzis.strftime(format='%Y%m%d')

In [189]:
pd.Series(data_dzis.strftime(format='%Y-%m-%d')).to_excel('testowa_data.xlsx')

In [191]:
# zapis do Excela dowolnych statystyk z dzisiejszą datą

In [195]:
df.groupby('Company').describe().to_excel(f'statystyki_{data_dzis}.xlsx')

In [199]:
data = {'dates': ['2024-01-15', '2024-02-10', '2024-03-05']}
data

{'dates': ['2024-01-15', '2024-02-10', '2024-03-05']}

In [200]:
df = pd.DataFrame(data)
df

        dates
0  2024-01-15
1  2024-02-10
2  2024-03-05

In [201]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dates   3 non-null      object
dtypes: object(1)
memory usage: 152.0+ bytes

In [202]:
df['dates'] = pd.to_datetime(df['dates'])

In [203]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   dates   3 non-null      datetime64[ns]
dtypes: datetime64[ns](1)
memory usage: 152.0 bytes

In [209]:
df['end_of_month'] = df['dates'] + pd.offsets.MonthEnd(0)

In [210]:
df

       dates end_of_month
0 2024-01-15   2024-01-31
1 2024-02-10   2024-02-29
2 2024-03-05   2024-03-31